atajos.tex
% Created 2025-11-24 lun 00:24
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Carlos}
\date{\today}
\title{Documentación de atajos y comandos Emacs}
\hypersetup{
 pdfauthor={Carlos},
 pdftitle={Documentación de atajos y comandos Emacs},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle
\tableofcontents


\section{Introducción}
\label{sec:org00f8e16}
Este archivo documenta:

\begin{itemize}
\item Los atajos de teclado \textbf{básicos} de Emacs (los más usados para movimiento,
cortar/pegar, ventanas, archivos, etc.).
\item Todos los atajos \textbf{personalizados} definidos en mi configuración:
\begin{itemize}
\item \texttt{core-base.el}
\item \texttt{core-files.el}
\item \texttt{core-ui.el}
\item \texttt{core-dev.el}
\item \texttt{core-notes.el}
\item \texttt{lang-org.el}
\item \texttt{lang-writing.el}
\item \texttt{lang-prog.el}
\item \texttt{lang-web.el}
\item \texttt{lang-web-extras.el}
\end{itemize}
\item Las funciones \texttt{my/...} que agregan comportamiento nuevo, con su código
fuente en bloques \texttt{emacs-lisp}.
\end{itemize}

Puedo abrir este archivo dentro de Emacs y usarlo como manual rápido.

\section{Convenciones de teclas}
\label{sec:orgd6f2241}

\begin{description}
\item[{\texttt{C-}}] tecla Control
\item[{\texttt{M-}}] tecla Meta (Alt o \texttt{ESC})
\item[{\texttt{S-}}] tecla Shift
\item Ejemplos:
\begin{itemize}
\item \texttt{C-x C-f}  → Control + x, luego Control + f
\item \texttt{M-x}      → Meta (Alt) + x
\item \texttt{<f6>}     → tecla de función F6
\end{itemize}
\end{description}

\section{Movimiento, edición, cortar y pegar (por defecto)}
\label{sec:orge39f18d}

\subsection{Movimiento del cursor}
\label{sec:org56cb0d8}

\begin{center}
\begin{tabular}{ll}
Tecla & Acción\\[0pt]
\hline
C-f & Carácter adelante\\[0pt]
C-b & Carácter atrás\\[0pt]
C-n & Línea siguiente\\[0pt]
C-p & Línea anterior\\[0pt]
M-f & Palabra adelante\\[0pt]
M-b & Palabra atrás\\[0pt]
C-a & Inicio de línea\\[0pt]
C-e & Fin de línea\\[0pt]
M-a & Inicio de oración\\[0pt]
M-e & Fin de oración\\[0pt]
M-< & Principio del buffer\\[0pt]
M-> & Final del buffer\\[0pt]
C-v & Página abajo\\[0pt]
M-v & Página arriba\\[0pt]
\end{tabular}
\end{center}

\subsection{Selección, cortar, copiar, pegar}
\label{sec:org09a08d3}

\begin{center}
\begin{tabular}{ll}
Tecla & Acción\\[0pt]
\hline
C-SPC & Empezar a marcar región\\[0pt]
C-g & Cancelar región/comando\\[0pt]
C-w & Cortar (kill) región\\[0pt]
M-w & Copiar región\\[0pt]
C-y & Pegar (yank)\\[0pt]
M-y & Navegar por el kill-ring\\[0pt]
\end{tabular}
\end{center}

\subsection{Deshacer}
\label{sec:org777e709}

\begin{center}
\begin{tabular}{ll}
Tecla & Acción\\[0pt]
\hline
C-/ & Deshacer\\[0pt]
C-\_ & Deshacer\\[0pt]
\end{tabular}
\end{center}

\section{Archivos y buffers}
\label{sec:org95f46e6}

\subsection{Archivos}
\label{sec:org269ac6d}

\begin{center}
\begin{tabular}{ll}
Tecla & Acción\\[0pt]
\hline
C-x C-f & Abrir archivo\\[0pt]
C-x C-s & Guardar archivo\\[0pt]
C-x C-w & Guardar como…\\[0pt]
C-x C-v & Reemplazar buffer por otro\\[0pt]
\end{tabular}
\end{center}

\subsection{Buffers}
\label{sec:orge822816}

\begin{center}
\begin{tabular}{ll}
Tecla & Acción\\[0pt]
\hline
C-x b & Cambiar de buffer\\[0pt]
C-x C-b & Lista de buffers\\[0pt]
C-x k & Cerrar (kill) buffer actual\\[0pt]
\end{tabular}
\end{center}

\section{Ventanas (splits)}
\label{sec:orgf4a9f03}

\begin{center}
\begin{tabular}{ll}
Tecla & Acción\\[0pt]
\hline
C-x 1 & Dejar solo la ventana actual\\[0pt]
C-x 2 & Dividir horizontalmente (una arriba/otra)\\[0pt]
C-x 3 & Dividir verticalmente (izquierda/derecha)\\[0pt]
C-x 0 & Cerrar ventana actual\\[0pt]
C-x o & Ir a la otra ventana\\[0pt]
\end{tabular}
\end{center}
