atajos.org
* Búsqueda y reemplazo

| Tecla | Acción                                  |
|-------+-----------------------------------------|
| C-s   | Búsqueda incremental adelante           |
| C-r   | Búsqueda incremental atrás              |
| M-%   | Buscar y reemplazar (query-replace)     |
| C-M-% | Buscar y reemplazar con regexp          |

* Ayuda en Emacs

| Tecla | Acción                                           |
|-------+--------------------------------------------------|
| C-h k | Describir qué hace una tecla                    |
| C-h f | Describir función                               |
| C-h v | Describir variable                               |
| C-h b | Ver todos los atajos activos en el buffer       |
| C-h m | Ayuda de los modos activos                      |
| C-h t | Tutorial interactivo de Emacs                   |

* Dired (gestor de archivos)

En =Dired= se agregan atajos personalizados, pero primero los básicos:

| Tecla | Acción                            |
|-------+-----------------------------------|
| RET   | Abrir archivo / entrar directorio |
| ^     | Subir al directorio padre         |
| +     | Crear directorio                  |
| m     | Marcar archivo                    |
| u     | Desmarcar archivo                 |
| d     | Marcar para borrar                |
| x     | Ejecutar borrados marcados        |
| g     | Refrescar listado                 |

Los atajos extra definidos en mi configuración están documentados más abajo.

* Org mode básico

| Tecla     | Acción                               |
|-----------+--------------------------------------|
| TAB       | Expandir/colapsar bloque             |
| S-TAB     | Ciclar visibilidad global            |
| M-RET     | Nuevo ítem al mismo nivel            |
| M-<up>    | Subir encabezado                     |
| M-<down>  | Bajar encabezado                     |
| M-<left>  | Promover encabezado                  |
| M-<right> | Degradar encabezado                  |

TODOs y agenda:

| Tecla   | Acción                  |
|---------+-------------------------|
| C-c C-t | Cambiar TODO/DONE       |
| C-c .   | Insertar fecha          |
| C-c C-s | SCHEDULED               |
| C-c C-d | DEADLINE                |

* Atajos personalizados globales

Los siguientes atajos se definen en mis módulos =core-*= y =lang-*=.

** Terminal integrada

| Tecla | Comando      | Descripción                           |
|-------+--------------+---------------------------------------|
| C-c t | =vterm=      | Abrir terminal =vterm=                |

** Layout de desarrollo

| Tecla | Comando         | Descripción                                        |
|-------+-----------------+----------------------------------------------------|
| <f9>  | =my/dev-layout= | Layout con Treemacs a la izquierda, código y vterm |

** Org-roam (notas diarias)

| Tecla   | Comando                          | Descripción                     |
|---------+----------------------------------+---------------------------------|
| C-c n d | =org-roam-dailies-goto-today=    | Ir a la nota diaria de hoy      |
| C-c n j | =org-roam-dailies-capture-today= | Capturar entrada en el diario   |

** Org agenda y capture

| Tecla | Comando       | Descripción             |
|-------+---------------+-------------------------|
| C-c a | =org-agenda=  | Agenda de Org           |
| C-c c | =org-capture= | Capturas rápidas de Org |

** Compilar y ejecutar C/C++

| Tecla | Comando               | Descripción                          |
|-------+-----------------------+--------------------------------------|
| C-c r | =my/compile-and-run=  | Compilar y ejecutar archivo actual  |

