atajos.tex

\section{Búsqueda y reemplazo}
\label{sec:orgf776ec5}

\begin{center}
\begin{tabular}{ll}
Tecla & Acción\\[0pt]
\hline
C-s & Búsqueda incremental adelante\\[0pt]
C-r & Búsqueda incremental atrás\\[0pt]
M-\% & Buscar y reemplazar (query-replace)\\[0pt]
C-M-\% & Buscar y reemplazar con regexp\\[0pt]
\end{tabular}
\end{center}

\section{Ayuda en Emacs}
\label{sec:org899d823}

\begin{center}
\begin{tabular}{ll}
Tecla & Acción\\[0pt]
\hline
C-h k & Describir qué hace una tecla\\[0pt]
C-h f & Describir función\\[0pt]
C-h v & Describir variable\\[0pt]
C-h b & Ver todos los atajos activos en el buffer\\[0pt]
C-h m & Ayuda de los modos activos\\[0pt]
C-h t & Tutorial interactivo de Emacs\\[0pt]
\end{tabular}
\end{center}

\section{Dired (gestor de archivos)}
\label{sec:org8f1fe28}

En \texttt{Dired} se agregan atajos personalizados, pero primero los básicos:

\begin{center}
\begin{tabular}{ll}
Tecla & Acción\\[0pt]
\hline
RET & Abrir archivo / entrar directorio\\[0pt]
\^{} & Subir al directorio padre\\[0pt]
+ & Crear directorio\\[0pt]
m & Marcar archivo\\[0pt]
u & Desmarcar archivo\\[0pt]
d & Marcar para borrar\\[0pt]
x & Ejecutar borrados marcados\\[0pt]
g & Refrescar listado\\[0pt]
\end{tabular}
\end{center}

Los atajos extra definidos en mi configuración están documentados más abajo.

\section{Org mode básico}
\label{sec:org0c649f3}

\begin{center}
\begin{tabular}{ll}
Tecla & Acción\\[0pt]
\hline
TAB & Expandir/colapsar bloque\\[0pt]
S-TAB & Ciclar visibilidad global\\[0pt]
M-RET & Nuevo ítem al mismo nivel\\[0pt]
M-<up> & Subir encabezado\\[0pt]
M-<down> & Bajar encabezado\\[0pt]
M-<left> & Promover encabezado\\[0pt]
M-<right> & Degradar encabezado\\[0pt]
\end{tabular}
\end{center}

TODOs y agenda:

\begin{center}
\begin{tabular}{ll}
Tecla & Acción\\[0pt]
\hline
C-c C-t & Cambiar TODO/DONE\\[0pt]
C-c . & Insertar fecha\\[0pt]
C-c C-s & SCHEDULED\\[0pt]
C-c C-d & DEADLINE\\[0pt]
\end{tabular}
\end{center}

\section{Atajos personalizados globales}
\label{sec:orgd78b4c7}

Los siguientes atajos se definen en mis módulos \texttt{core-*} y \texttt{lang-*}.

\subsection{Terminal integrada}
\label{sec:org3b954b6}

\begin{center}
\begin{tabular}{lll}
Tecla & Comando & Descripción\\[0pt]
\hline
C-c t & \texttt{vterm} & Abrir terminal \texttt{vterm}\\[0pt]
\end{tabular}
\end{center}

\subsection{Layout de desarrollo}
\label{sec:org44fe6c9}

\begin{center}
\begin{tabular}{lll}
Tecla & Comando & Descripción\\[0pt]
\hline
<f9> & \texttt{my/dev-layout} & Layout con Treemacs a la izquierda, código y vterm\\[0pt]
\end{tabular}
\end{center}

\subsection{Org-roam (notas diarias)}
\label{sec:orga649119}

\begin{center}
\begin{tabular}{lll}
Tecla & Comando & Descripción\\[0pt]
\hline
C-c n d & \texttt{org-roam-dailies-goto-today} & Ir a la nota diaria de hoy\\[0pt]
C-c n j & \texttt{org-roam-dailies-capture-today} & Capturar entrada en el diario\\[0pt]
\end{tabular}
\end{center}

\subsection{Org agenda y capture}
\label{sec:orgca386f6}

\begin{center}
\begin{tabular}{lll}
Tecla & Comando & Descripción\\[0pt]
\hline
C-c a & \texttt{org-agenda} & Agenda de Org\\[0pt]
C-c c & \texttt{org-capture} & Capturas rápidas de Org\\[0pt]
\end{tabular}
\end{center}

\subsection{Compilar y ejecutar C/C++}
\label{sec:orgde8dfc0}

\begin{center}
\begin{tabular}{lll}
Tecla & Comando & Descripción\\[0pt]
\hline
C-c r & \texttt{my/compile-and-run} & Compilar y ejecutar archivo actual\\[0pt]
\end{tabular}
\end{center}
