atajos.md


<a id="org5fe0eb2"></a>

# Búsqueda y reemplazo

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tecla</th>
<th scope="col" class="org-left">Acción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">C-s</td>
<td class="org-left">Búsqueda incremental adelante</td>
</tr>


<tr>
<td class="org-left">C-r</td>
<td class="org-left">Búsqueda incremental atrás</td>
</tr>


<tr>
<td class="org-left">M-%</td>
<td class="org-left">Buscar y reemplazar (query-replace)</td>
</tr>


<tr>
<td class="org-left">C-M-%</td>
<td class="org-left">Buscar y reemplazar con regexp</td>
</tr>
</tbody>
</table>


<a id="org9debae8"></a>

# Ayuda en Emacs

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tecla</th>
<th scope="col" class="org-left">Acción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">C-h k</td>
<td class="org-left">Describir qué hace una tecla</td>
</tr>


<tr>
<td class="org-left">C-h f</td>
<td class="org-left">Describir función</td>
</tr>


<tr>
<td class="org-left">C-h v</td>
<td class="org-left">Describir variable</td>
</tr>


<tr>
<td class="org-left">C-h b</td>
<td class="org-left">Ver todos los atajos activos en el buffer</td>
</tr>


<tr>
<td class="org-left">C-h m</td>
<td class="org-left">Ayuda de los modos activos</td>
</tr>


<tr>
<td class="org-left">C-h t</td>
<td class="org-left">Tutorial interactivo de Emacs</td>
</tr>
</tbody>
</table>


<a id="org9189605"></a>

# Dired (gestor de archivos)

En `Dired` se agregan atajos personalizados, pero primero los básicos:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tecla</th>
<th scope="col" class="org-left">Acción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">RET</td>
<td class="org-left">Abrir archivo / entrar directorio</td>
</tr>


<tr>
<td class="org-left">^</td>
<td class="org-left">Subir al directorio padre</td>
</tr>


<tr>
<td class="org-left">+</td>
<td class="org-left">Crear directorio</td>
</tr>


<tr>
<td class="org-left">m</td>
<td class="org-left">Marcar archivo</td>
</tr>


<tr>
<td class="org-left">u</td>
<td class="org-left">Desmarcar archivo</td>
</tr>


<tr>
<td class="org-left">d</td>
<td class="org-left">Marcar para borrar</td>
</tr>


<tr>
<td class="org-left">x</td>
<td class="org-left">Ejecutar borrados marcados</td>
</tr>


<tr>
<td class="org-left">g</td>
<td class="org-left">Refrescar listado</td>
</tr>
</tbody>
</table>

Los atajos extra definidos en mi configuración están documentados más abajo.


<a id="org8c49f56"></a>

# Org mode básico

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tecla</th>
<th scope="col" class="org-left">Acción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">TAB</td>
<td class="org-left">Expandir/colapsar bloque</td>
</tr>


<tr>
<td class="org-left">S-TAB</td>
<td class="org-left">Ciclar visibilidad global</td>
</tr>


<tr>
<td class="org-left">M-RET</td>
<td class="org-left">Nuevo ítem al mismo nivel</td>
</tr>


<tr>
<td class="org-left">M-&lt;up&gt;</td>
<td class="org-left">Subir encabezado</td>
</tr>


<tr>
<td class="org-left">M-&lt;down&gt;</td>
<td class="org-left">Bajar encabezado</td>
</tr>


<tr>
<td class="org-left">M-&lt;left&gt;</td>
<td class="org-left">Promover encabezado</td>
</tr>


<tr>
<td class="org-left">M-&lt;right&gt;</td>
<td class="org-left">Degradar encabezado</td>
</tr>
</tbody>
</table>

TODOs y agenda:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tecla</th>
<th scope="col" class="org-left">Acción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">C-c C-t</td>
<td class="org-left">Cambiar TODO/DONE</td>
</tr>


<tr>
<td class="org-left">C-c .</td>
<td class="org-left">Insertar fecha</td>
</tr>


<tr>
<td class="org-left">C-c C-s</td>
<td class="org-left">SCHEDULED</td>
</tr>


<tr>
<td class="org-left">C-c C-d</td>
<td class="org-left">DEADLINE</td>
</tr>
</tbody>
</table>


<a id="orgb928505"></a>

# Atajos personalizados globales

Los siguientes atajos se definen en mis módulos `core-*` y `lang-*`.


<a id="org8fde83c"></a>

## Terminal integrada

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tecla</th>
<th scope="col" class="org-left">Comando</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">C-c t</td>
<td class="org-left"><code>vterm</code></td>
<td class="org-left">Abrir terminal <code>vterm</code></td>
</tr>
</tbody>
</table>


<a id="orgfe17d97"></a>

## Layout de desarrollo

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tecla</th>
<th scope="col" class="org-left">Comando</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">&lt;f9&gt;</td>
<td class="org-left"><code>my/dev-layout</code></td>
<td class="org-left">Layout con Treemacs a la izquierda, código y vterm</td>
</tr>
</tbody>
</table>


<a id="org700137b"></a>

## Org-roam (notas diarias)

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tecla</th>
<th scope="col" class="org-left">Comando</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">C-c n d</td>
<td class="org-left"><code>org-roam-dailies-goto-today</code></td>
<td class="org-left">Ir a la nota diaria de hoy</td>
</tr>


<tr>
<td class="org-left">C-c n j</td>
<td class="org-left"><code>org-roam-dailies-capture-today</code></td>
<td class="org-left">Capturar entrada en el diario</td>
</tr>
</tbody>
</table>


<a id="org03432da"></a>

## Org agenda y capture

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tecla</th>
<th scope="col" class="org-left">Comando</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">C-c a</td>
<td class="org-left"><code>org-agenda</code></td>
<td class="org-left">Agenda de Org</td>
</tr>


<tr>
<td class="org-left">C-c c</td>
<td class="org-left"><code>org-capture</code></td>
<td class="org-left">Capturas rápidas de Org</td>
</tr>
</tbody>
</table>


<a id="org688d03a"></a>

## Compilar y ejecutar C/C++

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tecla</th>
<th scope="col" class="org-left">Comando</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">C-c r</td>
<td class="org-left"><code>my/compile-and-run</code></td>
<td class="org-left">Compilar y ejecutar archivo actual</td>
</tr>
</tbody>
</table>
