atajos.org
** Diccionarios de ortografía

| Tecla   | Comando            | Descripción                          |
|---------+--------------------+--------------------------------------|
| C-c d s | =my/dict-spanish=  | Diccionario español (es_AR)         |
| C-c d e | =my/dict-english=  | Diccionario inglés (en_US)          |

** Exportar a DOCX

| Tecla   | Comando                    | Descripción                                       |
|---------+----------------------------+---------------------------------------------------|
| C-c e w | =my/export-buffer-to-docx= | Exportar buffer actual a DOCX usando pandoc       |

* Atajos personalizados en Dired

En =core-files.el= se agregan atajos para crear directorios y archivos
directamente desde Dired:

| Modo  | Tecla | Comando                       | Descripción                           |
|-------+-------+-------------------------------+---------------------------------------|
| Dired | <f6>  | =my/dired-create-empty-file=  | Crear archivo vacío en Dired         |
| Dired | <f7>  | =my/dired-create-directory=   | Crear nuevo directorio en Dired      |

* Atajos personalizados en LaTeX

En =lang-writing.el= (AUCTeX / LaTeX):

| Modo       | Tecla | Comando              | Descripción                           |
|------------+-------+----------------------+---------------------------------------|
| LaTeX-mode | C-c e | =my/latex-equation=  | Insertar entorno =equation=           |
| LaTeX-mode | C-c f | =my/latex-figure=    | Insertar entorno =figure=             |
| LaTeX-mode | C-c t | =my/latex-table=     | Insertar entorno =table=              |
| LaTeX-mode | C-c i | =my/latex-itemize=   | Insertar entorno =itemize=            |

* Funciones =my/...= y código fuente

A continuación, el código fuente de todas las funciones =my/...= definidas en
los módulos. Sirve como referencia y también como ejemplo para futuras
modificaciones.

** =core-dev.el= :: layout de desarrollo

#+begin_src emacs-lisp
(defun my/dev-layout ()
  "Abrir layout con Treemacs a la izquierda, código arriba y vterm abajo."
  (interactive)
  (delete-other-windows)
  ;; Panel izquierdo: Treemacs
  (treemacs)
  ;; Nos movemos a la ventana de la derecha para código
  (select-window (next-window))
  ;; Partimos la derecha en dos (arriba código, abajo terminal)
  (split-window-below)
  ;; Ventana superior derecha: se queda para el buffer actual
  (other-window 1)
  ;; Ventana inferior derecha: vterm
  (vterm)
  ;; Volver a la ventana de código
  (other-window -1))
#+end_src

** =core-files.el= :: utilidades para Dired

#+begin_src emacs-lisp
(defun my/dired-create-directory ()
  "Crear un nuevo directorio en el Dired actual, con un prompt claro."
  (interactive)
  (let* ((dir (dired-current-directory))
         (name (read-string (format "Nombre del nuevo directorio en %s: " dir))))
    (when (and name (not (string-empty-p name)))
      (let ((full (expand-file-name name dir)))
        (make-directory full t)
        (revert-buffer)
        (message "Directorio creado: %s" full)))))

(defun my/dired-create-empty-file ()
  "Crear un nuevo archivo vacío en el Dired actual, con un prompt claro."
  (interactive)
  (let* ((dir (dired-current-directory))
         (name (read-string (format "Nombre del nuevo archivo en %s: " dir))))
    (when (and name (not (string-empty-p name)))
      (let ((full (expand-file-name name dir)))
        (with-temp-buffer
          (write-file full))
        (revert-buffer)
        (message "Archivo creado: %s" full)))))

(with-eval-after-load 'dired
  (define-key dired-mode-map (kbd "<f6>") #'my/dired-create-empty-file)
  (define-key dired-mode-map (kbd "<f7>") #'my/dired-create-directory))
#+end_src

