atajos.tex

\subsection{Diccionarios de ortografía}
\label{sec:orgd961ff8}

\begin{center}
\begin{tabular}{lll}
Tecla & Comando & Descripción\\[0pt]
\hline
C-c d s & \texttt{my/dict-spanish} & Diccionario español (es\textsubscript{AR})\\[0pt]
C-c d e & \texttt{my/dict-english} & Diccionario inglés (en\textsubscript{US})\\[0pt]
\end{tabular}
\end{center}

\subsection{Exportar a DOCX}
\label{sec:org407c1fa}

\begin{center}
\begin{tabular}{lll}
Tecla & Comando & Descripción\\[0pt]
\hline
C-c e w & \texttt{my/export-buffer-to-docx} & Exportar buffer actual a DOCX usando pandoc\\[0pt]
\end{tabular}
\end{center}

\section{Atajos personalizados en Dired}
\label{sec:org3798b1c}

En \texttt{core-files.el} se agregan atajos para crear directorios y archivos
directamente desde Dired:

\begin{center}
\begin{tabular}{llll}
Modo & Tecla & Comando & Descripción\\[0pt]
\hline
Dired & <f6> & \texttt{my/dired-create-empty-file} & Crear archivo vacío en Dired\\[0pt]
Dired & <f7> & \texttt{my/dired-create-directory} & Crear nuevo directorio en Dired\\[0pt]
\end{tabular}
\end{center}

\section{Atajos personalizados en \LaTeX{}}
\label{sec:orgaf2ff31}

En \texttt{lang-writing.el} (AUCTeX / \LaTeX{}):

\begin{center}
\begin{tabular}{llll}
Modo & Tecla & Comando & Descripción\\[0pt]
\hline
\LaTeX{}-mode & C-c e & \texttt{my/latex-equation} & Insertar entorno \texttt{equation}\\[0pt]
\LaTeX{}-mode & C-c f & \texttt{my/latex-figure} & Insertar entorno \texttt{figure}\\[0pt]
\LaTeX{}-mode & C-c t & \texttt{my/latex-table} & Insertar entorno \texttt{table}\\[0pt]
\LaTeX{}-mode & C-c i & \texttt{my/latex-itemize} & Insertar entorno \texttt{itemize}\\[0pt]
\end{tabular}
\end{center}

\section{Funciones \texttt{my/...} y código fuente}
\label{sec:org5c45065}

A continuación, el código fuente de todas las funciones \texttt{my/...} definidas en
los módulos. Sirve como referencia y también como ejemplo para futuras
modificaciones.

\subsection{\texttt{core-dev.el} :: layout de desarrollo}
\label{sec:orgb26d0a7}

\begin{verbatim}
(defun my/dev-layout ()
  "Abrir layout con Treemacs a la izquierda, código arriba y vterm abajo."
  (interactive)
  (delete-other-windows)
  ;; Panel izquierdo: Treemacs
  (treemacs)
  ;; Nos movemos a la ventana de la derecha para código
  (select-window (next-window))
  ;; Partimos la derecha en dos (arriba código, abajo terminal)
  (split-window-below)
  ;; Ventana superior derecha: se queda para el buffer actual
  (other-window 1)
  ;; Ventana inferior derecha: vterm
  (vterm)
  ;; Volver a la ventana de código
  (other-window -1))
\end{verbatim}

\subsection{\texttt{core-files.el} :: utilidades para Dired}
\label{sec:org2307cc6}

\begin{verbatim}
(defun my/dired-create-directory ()
  "Crear un nuevo directorio en el Dired actual, con un prompt claro."
  (interactive)
  (let* ((dir (dired-current-directory))
         (name (read-string (format "Nombre del nuevo directorio en %s: " dir))))
    (when (and name (not (string-empty-p name)))
      (let ((full (expand-file-name name dir)))
        (make-directory full t)
        (revert-buffer)
        (message "Directorio creado: %s" full)))))

(defun my/dired-create-empty-file ()
  "Crear un nuevo archivo vacío en el Dired actual, con un prompt claro."
  (interactive)
  (let* ((dir (dired-current-directory))
         (name (read-string (format "Nombre del nuevo archivo en %s: " dir))))
    (when (and name (not (string-empty-p name)))
      (let ((full (expand-file-name name dir)))
        (with-temp-buffer
          (write-file full))
        (revert-buffer)
        (message "Archivo creado: %s" full)))))

(with-eval-after-load 'dired
  (define-key dired-mode-map (kbd "<f6>") #'my/dired-create-empty-file)
  (define-key dired-mode-map (kbd "<f7>") #'my/dired-create-directory))
\end{verbatim}
