atajos.md


<a id="org60727de"></a>

## Diccionarios de ortografía

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tecla</th>
<th scope="col" class="org-left">Comando</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">C-c d s</td>
<td class="org-left"><code>my/dict-spanish</code></td>
<td class="org-left">Diccionario español (es<sub>AR</sub>)</td>
</tr>


<tr>
<td class="org-left">C-c d e</td>
<td class="org-left"><code>my/dict-english</code></td>
<td class="org-left">Diccionario inglés (en<sub>US</sub>)</td>
</tr>
</tbody>
</table>


<a id="org4cd8837"></a>

## Exportar a DOCX

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tecla</th>
<th scope="col" class="org-left">Comando</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">C-c e w</td>
<td class="org-left"><code>my/export-buffer-to-docx</code></td>
<td class="org-left">Exportar buffer actual a DOCX usando pandoc</td>
</tr>
</tbody>
</table>


<a id="orgff5de3c"></a>

# Atajos personalizados en Dired

En `core-files.el` se agregan atajos para crear directorios y archivos
directamente desde Dired:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Modo</th>
<th scope="col" class="org-left">Tecla</th>
<th scope="col" class="org-left">Comando</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Dired</td>
<td class="org-left">&lt;f6&gt;</td>
<td class="org-left"><code>my/dired-create-empty-file</code></td>
<td class="org-left">Crear archivo vacío en Dired</td>
</tr>


<tr>
<td class="org-left">Dired</td>
<td class="org-left">&lt;f7&gt;</td>
<td class="org-left"><code>my/dired-create-directory</code></td>
<td class="org-left">Crear nuevo directorio en Dired</td>
</tr>
</tbody>
</table>


<a id="orgbe97225"></a>

# Atajos personalizados en LaTeX

En `lang-writing.el` (AUCTeX / LaTeX):

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Modo</th>
<th scope="col" class="org-left">Tecla</th>
<th scope="col" class="org-left">Comando</th>
<th scope="col" class="org-left">Descripción</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">LaTeX-mode</td>
<td class="org-left">C-c e</td>
<td class="org-left"><code>my/latex-equation</code></td>
<td class="org-left">Insertar entorno <code>equation</code></td>
</tr>


<tr>
<td class="org-left">LaTeX-mode</td>
<td class="org-left">C-c f</td>
<td class="org-left"><code>my/latex-figure</code></td>
<td class="org-left">Insertar entorno <code>figure</code></td>
</tr>


<tr>
<td class="org-left">LaTeX-mode</td>
<td class="org-left">C-c t</td>
<td class="org-left"><code>my/latex-table</code></td>
<td class="org-left">Insertar entorno <code>table</code></td>
</tr>


<tr>
<td class="org-left">LaTeX-mode</td>
<td class="org-left">C-c i</td>
<td class="org-left"><code>my/latex-itemize</code></td>
<td class="org-left">Insertar entorno <code>itemize</code></td>
</tr>
</tbody>
</table>


<a id="org1c8d38c"></a>

# Funciones `my/...` y código fuente

A continuación, el código fuente de todas las funciones `my/...` definidas en
los módulos. Sirve como referencia y también como ejemplo para futuras
modificaciones.


<a id="orge4fd868"></a>

## `core-dev.el` :: layout de desarrollo

    (defun my/dev-layout ()
      "Abrir layout con Treemacs a la izquierda, código arriba y vterm abajo."
      (interactive)
      (delete-other-windows)
      ;; Panel izquierdo: Treemacs
      (treemacs)
      ;; Nos movemos a la ventana de la derecha para código
      (select-window (next-window))
      ;; Partimos la derecha en dos (arriba código, abajo terminal)
      (split-window-below)
      ;; Ventana superior derecha: se queda para el buffer actual
      (other-window 1)
      ;; Ventana inferior derecha: vterm
      (vterm)
      ;; Volver a la ventana de código
      (other-window -1))


<a id="org92fc422"></a>

## `core-files.el` :: utilidades para Dired

    (defun my/dired-create-directory ()
      "Crear un nuevo directorio en el Dired actual, con un prompt claro."
      (interactive)
      (let* ((dir (dired-current-directory))
             (name (read-string (format "Nombre del nuevo directorio en %s: " dir))))
        (when (and name (not (string-empty-p name)))
          (let ((full (expand-file-name name dir)))
            (make-directory full t)
            (revert-buffer)
            (message "Directorio creado: %s" full)))))
    
    (defun my/dired-create-empty-file ()
      "Crear un nuevo archivo vacío en el Dired actual, con un prompt claro."
      (interactive)
      (let* ((dir (dired-current-directory))
             (name (read-string (format "Nombre del nuevo archivo en %s: " dir))))
        (when (and name (not (string-empty-p name)))
          (let ((full (expand-file-name name dir)))
            (with-temp-buffer
              (write-file full))
            (revert-buffer)
            (message "Archivo creado: %s" full)))))
    
    (with-eval-after-load 'dired
      (define-key dired-mode-map (kbd "<f6>") #'my/dired-create-empty-file)
      (define-key dired-mode-map (kbd "<f7>") #'my/dired-create-directory))
