atajos.md


<a id="org62995e1"></a>

## `lang-prog.el` :: programación (C/C++)

    (defun my/c-enabled ()
      "Config básica para C/C++: estilo, sangría, etc."
      (c-set-style "linux")
      (setq c-basic-offset 4
            indent-tabs-mode nil))
    
    (add-hook 'c-mode-hook #'my/c-enabled)
    (add-hook 'c++-mode-hook #'my/c-enabled)
    
    (defun my/compile-and-run ()
      "Compilar y ejecutar el archivo C/C++ actual en una ventana vterm.
    Compila con g++ -std=c++20 -O2 y ejecuta el binario resultante."
      (interactive)
      (unless buffer-file-name
        (user-error "El buffer no está asociado a un archivo"))
      (save-buffer)
      (let* ((src buffer-file-name)
             (exe (file-name-sans-extension src))
             (cmd (format "g++ -std=c++20 -O2 -o %s %s && %s\n" exe src exe)))
        (unless (executable-find "g++")
          (user-error "g++ no está instalado"))
        (let ((vterm-buf (get-buffer "*vterm-compilacion*")))
          (if vterm-buf
              (pop-to-buffer vterm-buf)
            (setq vterm-buf (vterm "*vterm-compilacion*")))
          (vterm-send-string cmd)
          (vterm-send-return))))


<a id="orgb8f69ee"></a>

## `lang-web-extras.el` :: helpers para Vue / Alpine, etc.

    (defun my/vue-insert-sfc ()
      "Insertar skeleton básico de Single File Component Vue 3."
      (interactive)
      (insert "<template>\n  <div class=\"\">\n  </div>\n</template>\n\n")
      (insert "<script setup>\n\n</script>\n\n")
      (insert "<style scoped>\n\n</style>\n")
      (message "Vue SFC insertado."))
    
    (defun my/alpine-insert-component ()
      "Insertar un snippet básico para un componente con Alpine.js."
      (interactive)
      (insert "<div x-data=\"{ open: false }\">\n")
      (insert "  <button @click=\"open = !open\">Toggle</button>\n")
      (insert "  <div x-show=\"open\">\n")
      (insert "    Contenido...\n")
      (insert "  </div>\n")
      (insert "</div>\n")
      (message "Snippet Alpine.js insertado."))
    
    (defun my/tailwind-insert-container ()
      "Insertar un contenedor básico con clases de Tailwind CSS."
      (interactive)
      (insert "<div class=\"max-w-4xl mx-auto px-4 sm:px-6 lg:px-8\">\n")
      (insert "  <!-- Contenido -->\n")
      (insert "</div>\n")
      (message "Contenedor Tailwind CSS insertado."))
