atajos.md


<a id="orgbdd93f5"></a>

## `lang-writing.el` :: escritura, Markdown, LaTeX, ortografía, exportación

Incluye helpers para:

-   Cambiar diccionarios (español/inglés).
-   Helpers de Markdown (negrita, itálica, código, enlaces, etc.).
-   Helpers de LaTeX (entornos `equation`, `figure`, `table`, `itemize`).
-   Exportar el archivo actual a DOCX con `pandoc`.

Código completo:

    (defun my/dict-spanish ()
      "Cambiar diccionario a español (es_AR)."
      (interactive)
      (ispell-change-dictionary "es_AR")
      (message "Diccionario cambiado a español (es_AR)"))
    
    (defun my/dict-english ()
      "Cambiar diccionario a inglés (en_US)."
      (interactive)
      (ispell-change-dictionary "en_US")
      (message "Dictionary changed to English (en_US)"))
    
    (global-set-key (kbd "C-c d s") #'my/dict-spanish)
    (global-set-key (kbd "C-c d e") #'my/dict-english)
    
    ;; Helpers Markdown
    (defun my/markdown-wrap (left right)
      "Envolver la región activa (o palabra actual) entre LEFT y RIGHT."
      (if (use-region-p)
          (let ((beg (region-beginning))
                (end (region-end)))
            (goto-char end)
            (insert right)
            (goto-char beg)
            (insert left))
        (let ((bounds (bounds-of-thing-at-point 'word)))
          (when bounds
            (goto-char (cdr bounds))
            (insert right)
            (goto-char (car bounds))
            (insert left)))))
    
    (defun my/markdown-bold ()
      "Negrita Markdown para región o palabra actual."
      (interactive)
      (my/markdown-wrap "**" "**"))
    
    (defun my/markdown-italic ()
      "Itálica Markdown para región o palabra actual."
      (interactive)
      (my/markdown-wrap "*" "*"))
    
    (defun my/markdown-inline-code ()
      "Código en línea Markdown para región o palabra actual."
      (interactive)
      (my/markdown-wrap "`" "`"))
    
    (defun my/markdown-link ()
      "Insertar un enlace Markdown. Si hay región, usarla como texto."
      (interactive)
      (let* ((url (read-string "URL: "))
             (text (if (use-region-p)
                       (buffer-substring-no-properties (region-beginning)
                                                       (region-end))
                     (read-string "Texto del enlace: "))))
        (when (use-region-p)
          (delete-region (region-beginning) (region-end)))
        (insert (format "[%s](%s)" text url))))
    
    (defun my/markdown-setup-keys ()
      "Configurar atajos para helpers de Markdown."
      (local-set-key (kbd "C-c m b") #'my/markdown-bold)
      (local-set-key (kbd "C-c m i") #'my/markdown-italic)
      (local-set-key (kbd "C-c m c") #'my/markdown-inline-code)
      (local-set-key (kbd "C-c m l") #'my/markdown-link))
    
    (add-hook 'markdown-mode-hook #'my/markdown-setup-keys)
    
    ;; Helpers LaTeX
    (defun my/latex-insert-environment (name)
      "Insertar un entorno LaTeX \\begin{NAME} ... \\end{NAME}, con punto de inserción en medio."
      (interactive "sNombre del entorno: ")
      (insert (format "\\begin{%s}\n" name))
      (save-excursion
        (insert (format "\n\\end{%s}\n" name))))
    
    (defun my/latex-equation ()
      "Insertar entorno equation."
      (interactive)
      (my/latex-insert-environment "equation"))
    
    (defun my/latex-itemize ()
      "Insertar entorno itemize."
      (interactive)
      (my/latex-insert-environment "itemize"))
    
    (defun my/latex-figure ()
      "Insertar entorno figure."
      (interactive)
      (my/latex-insert-environment "figure"))
    
    (defun my/latex-table ()
      "Insertar entorno table."
      (interactive)
      (my/latex-insert-environment "table"))
    
    (with-eval-after-load 'latex
      (define-key LaTeX-mode-map (kbd "C-c e") #'my/latex-equation)
      (define-key LaTeX-mode-map (kbd "C-c f") #'my/latex-figure)
      (define-key LaTeX-mode-map (kbd "C-c t") #'my/latex-table)
      (define-key LaTeX-mode-map (kbd "C-c i") #'my/latex-itemize))
    
    ;; Exportar a DOCX con pandoc
    (defun my/export-buffer-to-docx ()
      "Exportar el archivo actual a DOCX usando pandoc.
    Funciona bien para Org y Markdown."
      (interactive)
      (unless buffer-file-name
        (user-error "El buffer no está asociado a un archivo"))
      (unless (executable-find "pandoc")
        (user-error "pandoc no está instalado"))
      (save-buffer)
      (let* ((in  (buffer-file-name))
             (out (concat (file-name-sans-extension in) ".docx")))
        (call-process "pandoc" nil "*Pandoc Output*" t in "-o" out)
        (message "Exportado a %s" out)))
    
    (global-set-key (kbd "C-c e w") #'my/export-buffer-to-docx)

